// Задача 10: 
// Напишите программу, которая принимает на вход трёхзначное число 
// и на выходе показывает вторую цифру этого числа. 
// Выполнить с помощью числовых операций (целочисленное деление, остаток от деления).
// 456 -> 5
// 782 -> 8
// 918 -> 1


Console.Writeline("Введите трехзначное число");
int a = Convert.ToInt32(Console.Readline());
// if (a < 100) 
//  Console.Writeline($"Вы ввели не трехзначное число =(");

//  if (a > 100)
//  {
//  do  
//  {
//     (a=a/10);
//       Console.Write($"{a}"); 
//       }
//   while (a/100>0);
//  }
//  int number = a%10;
// Console.Writeline($"{a}");
